import React from "react";

function Introduce() {
  return (
    <div>
      <header className="title mb-[10px]">Introduce</header>
      <p className="pl-[5px]">
        <h3>- 개발에 대한 흥미</h3>
        <p className="pl-[20px] text-[gray]">
          대학교 컴퓨터프로그래밍수업을 통해 c언어를 접하게 되었습니다. 그 때
          기말고사 대체 과제로 콘솔게임을 만들게 되었고 그 때 다른 누군가에게
          내가 생각한 무언가를 표현한다는 것에 너무 흥미를 느껴 개발을 시작하게
          되었습니다.
        </p>
        <h3>- 디지털영상처리 경험</h3>
        <p className="pl-[20px] text-[gray]">
          교수님의 추천으로 디지털영상처리 연구실에 들어가서 2년간 연구실 생활을
          하였습니다. 연구실에서는 영상처리를 위한 수단으로서 c++, MFC, C# 을
          공부하여 다양한 영상처리 알고리즘을 구현해보고 openCV라이브러리를 통한
          프로젝트도 경험했습니다
        </p>
        <h3>- 웹 프론트엔드 개발자로 진로 결정</h3>
        <p className="pl-[20px] text-[gray]">
          군휴학을 하고 복무를 하면서 영상처리말고 다른분야의 개발쪽에 관심이
          생겼고 게임, 웹, 앱 다양하게 공부해보면서 흥미있는 분야를 찾다가
          웹쪽에 가장 큰 흥미를 느껴 진로를 결정하였습니다. 머릿속에 있는 것을
          코드로 표현하는 것을 좋아하고 개발한 것을 자랑하는 것을 좋아하는
          성격인지라 프론트엔드 개발이 가장 잘맞았습니다.
        </p>
        {/* 되었고 교수님의 추천으로 디지털영상처리 연구실에 들어가게 되었습니다.
        연구실 생활을 하며 c++, MFC(C++ 윈도우 프로그래밍), C# 윈도우
        프로그래밍을 공부하여 영상처리를 위한 수단으로서 프로그래밍을
        공부해왔습니다. 그러던 중 병역복무로 2년간 휴학을 하게 되었고 병역에
        복무하면서 영상처리말고 다른 분야를 공부해보고 싶었고 unity, 안드로이드,
        자동화프로그램, 웹쪽으로 조금씩 공부를 해보았습니다. 그러면서 가장
        흥미가 생긴 웹 프론트쪽으로 먼저 깊게 공부해보고 싶어서 현재 공부 중에
        있습니다. 만든것을 자랑하는 것을 좋아하는 성격이라 친구들에게 보여주기에
        웹이 접근성이 너무 좋아서 처음에 시작하게 됐습니다. */}
      </p>
    </div>
  );
}

export default Introduce;
